DataProcessors/Renault_РаботаСНовостямиДилеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>Renault_РаботаСНовостямиДилеров</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресWS</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинWS</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольWS</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/CRM_ПрочитанныеНовости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>CRM_ПрочитанныеНовости</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Прочитана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторНовости</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/Renault_РаботаСНовостямиДилеров/Forms/ФормаНовости/Ext/Form/Module.bsl
&НаСервере
Процедура ЗаписатьНаСервере()
	
	Для Каждого Строка ИЗ ТаблицаНаЗапись Цикл
		Запись = РегистрыСведений.CRM_ПрочитанныеНовости.СоздатьМенеджерЗаписи();
		Запись.ИдентификаторНовости = Новый УникальныйИдентификатор(Строка.ИдентификаторНовости);
		Запись.Прочитана = Истина;
		Запись.Сотрудник = ПараметрыСеанса.Пользователь.Сотрудник;
		Запись.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	ЗаписатьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНовостьНаСервере(ИндексНовости)
	
	СтрокаНовости = ТаблицаНовостей.Найти(Число(ИндексНовости), "ИндексСтроки");
	Если СтрНайти(СтрокаНовости.ТекстНовости,"<html>")<>0 тогда
		ТекстНовости = СтрокаНовости.ТекстНовости;
	Иначе
		ТекстНовости = "<html><body><h1>"+СтрокаНовости.ТекстНовости+"</h1></body></html>";
	КонецЕсли;	
	Элементы.ТекстНовости.Заголовок = СтрокаНовости.ЗаголовокНовости;
	Если ЭтаФорма.ТекущийЭлемент.ЦветТекста = Новый Цвет(0, 0, 255) Тогда
		НоваяЗапись = ТаблицаНаЗапись.Добавить();
		НоваяЗапись.НовостьПрочитана = Истина;
		ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаНовости);
		ЭтаФорма.ТекущийЭлемент.ЦветТекста = Новый Цвет(255, 0, 255);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТаблицаНовостей = Параметры.Параметр;
	ТаблицаНовостей.Колонки.Добавить("ИндексСтроки");
	Индекс = 0;
	Для Каждого Строка ИЗ ТаблицаНовостей Цикл
		Индекс = Индекс+1;
		Декорация = Элементы.Добавить("Декорация"+Индекс, Тип("КнопкаФормы"), Элементы.ГруппаСписокНовостей);
		Строка.ИндексСтроки = Индекс;
		Декорация.Заголовок = Строка.ЗаголовокНовости;
		Декорация.ИмяКоманды = "ДекорацияНажатие";
		Декорация.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
		Декорация.ОтображениеФигуры = ОтображениеФигурыКнопки.Нет; 
		Декорация.ЦветТекста = Новый Цвет(0, 0, 255);
		Декорация.ЦветРамки = Новый Цвет(252, 250, 235);
		Декорация.ЦветФона = Новый Цвет(252, 250, 235);
		Декорация.Ширина = 20;
	КонецЦикла;
	
	ПерваяСтрока = ТаблицаНаЗапись.Добавить();
	ЗаполнитьЗначенияСвойств(ПерваяСтрока, ТаблицаНовостей[0]);
	ПерваяСтрока.НовостьПрочитана = Истина;
	ТекстНовости = ПерваяСтрока.ТекстНовости;
	Элементы.ТекстНовости.Заголовок = ПерваяСтрока.ЗаголовокНовости;
	Если Элементы.Найти("Декорация1") <> Неопределено Тогда
		Элементы.Найти("Декорация1").ЦветТекста = Новый Цвет(255, 0, 255);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияНажатие(Команда)
	
	ТекущаяНовость = ЭтаФорма.ТекущийЭлемент.Имя;
	ИндексНовости = Сред(ТекущаяНовость, 10);
	ПрочитатьНовостьНаСервере(ИндексНовости);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьАрхив(Команда)
	
	Форма = ПолучитьФорму("Обработка.Renault_РаботаСНовостямиДилеров.Форма.АрхивНовостей");
	Форма.Открыть();
	
КонецПроцедуры
